{
    "results": [
        {
            "id": 1,
            "date": "2023-06-22",
            "title": "Расширение прав для питомцев в аэропортах",
            "text": "Сегодня было объявлено о расширении прав для питомцев в аэропортах. Теперь владельцы смогут переносить своих питомцев на борту самолета и не оставлять их на земле.",
            "author": "admin",
            "comments": [
                {
                    "id": 1,
                    "date": "2023-06-23",
                    "text": "Какая замечательная новость! Я всегда беспокоился за своего питомца, когда приходилось оставлять его дома.",
                    "author": "user1",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 2,
                    "date": "2023-06-24",
                    "text": "Это так мило! Теперь питомцы тоже смогут летать с нами!",
                    "author": "user2",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 3,
                    "date": "2023-06-25",
                    "text": "Теперь все смогут летать со своими питомцами, это идеально для тех, кто не может оставить своих питомцев дома.",
                    "author": "user3",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 4,
                    "date": "2023-06-25",
                    "text": "Это прекрасная новость! Я так рада, что мой любимый пес может лететь со мной!",
                    "author": "user4",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 5,
                    "date": "2023-06-26",
                    "text": "Очень здорово, что теперь питомцы имеют такие же права, как и люди!",
                    "author": "user5",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 6,
                    "date": "2023-06-27",
                    "text": "Это просто чудесно! Я так счастлива, что смогу лететь со своей кошкой!",
                    "author": "user6",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 7,
                    "date": "2023-06-27",
                    "text": "Теперь у меня есть еще одна причина выбирать авиакомпании, которые разрешают перевозку питомцев!",
                    "author": "user7",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 8,
                    "date": "2023-06-28",
                    "text": "Я так рад, что мой пес не должен больше оставаться один дома, когда я летаю!",
                    "author": "user8",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 9,
                    "date": "2023-06-29",
                    "text": "Это отличная новость! Теперь у меня будет компания во время полета!",
                    "author": "user9",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 10,
                    "date": "2023-06-30",
                    "text": "Я очень рада, что моя кошка сможет летать со мной.",
                    "author": "user10",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                },
                {
                    "id": 11,
                    "date": "2023-07-01",
                    "text": "Очень круто, что теперь мы можем брать своих питомцев с собой в долгие путешествия!",
                    "author": "user11",
                    "news": 1,
                    "news_title": "Расширение прав для питомцев в аэропортах"
                }
            ],
            "likes": null
        },
        {
            "id": 2,
            "date": "2023-06-21",
            "title": "Объявлены победители международного конкурса фотографии",
            "text": "Сегодня были объявлены победители международного конкурса фотографии. Главный приз ушел к фотографии, которая была сделана на вершине горы Эверест.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 3,
            "date": "2023-06-25",
            "title": "Запуск новой космической программы",
            "text": "Сегодня была объявлена о запуске новой космической программы, которая ставит целью колонизацию Марса. Программа предполагает отправку первых экспедиций на Марс уже через пять лет.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 4,
            "date": "2023-06-26",
            "title": "Открытие парка развлечений",
            "text": "Сегодня в Минске открылся новый парк развлечений, который стал самым большим в стране. На его территории расположены аттракционы для детей и взрослых, кафе, магазины и зоопарк. В честь открытия парк проводит акцию: все посетители первого дня могут бесплатно пользоваться аттракционами.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 5,
            "date": "2023-06-27",
            "title": "Представлена новая версия операционной системы",
            "text": "Сегодня на ежегодной конференции разработчиков была представлена новая версия операционной системы. Среди главных новшеств - улучшенная производительность, более продвинутый и удобный интерфейс, а также новые функции для повышения безопасности данных пользователей. Разработчики обещают, что новая ОС будет доступна пользователям уже через несколько месяцев.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 6,
            "date": "2023-06-27",
            "title": "Представлена новая версия операционной системы",
            "text": "Сегодня на ежегодной конференции разработчиков была представлена новая версия операционной системы. Среди главных новшеств - улучшенная производительность, более продвинутый и удобный интерфейс, а также новые функции для повышения безопасности данных пользователей. Разработчики обещают, что новая ОС будет доступна пользователям уже через несколько месяцев.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 7,
            "date": "2023-06-28",
            "title": "Обнаружены свидетельства древней цивилизации в Южной Америке",
            "text": "Группа исследователей обнаружила новые свидетельства существования древней цивилизации, которая процветала на территории современной Южной Америки более 2 тысяч лет назад. В районе археологических раскопок были найдены артефакты, сооружения и документы на неизвестном языке. Ученые уже начали изучение найденных материалов и надеются узнать больше о жизни и культуре этой загадочной цивилизации.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 8,
            "date": "2023-06-29",
            "title": "В США началась кампания по борьбе с наркотиками",
            "text": "Президент США объявил о начале крупнейшей в истории страны кампании по борьбе с наркотиками. В рамках кампании планируется ужесточение законодательства, увеличение финансирования мероприятий по борьбе с наркотиками и проведение образовательных программ для населения. Целью кампании является снижение количества наркозависимых и смертности от передозировок.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 9,
            "date": "2023-06-30",
            "title": "Компания SpaceX отправила на орбиту спутник для мониторинга изменений климата",
            "text": "Компания SpaceX успешно запустила ракету-носитель с новым спутником, который будет использоваться для мониторинга изменений климата на Земле. Спутник оснащен передовыми технологиями, позволяющими получать данные с высокой точностью и в режиме реального времени. Это позволит ученым более точно прогнозировать изменения климата и разрабатывать стратегии для борьбы с негативными последствиями.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 10,
            "date": "2023-07-01",
            "title": "В Японии представлен новый прототип электрического автомобиля с большим запасом хода",
            "text": "Японский автопроизводитель представил прототип нового электрического автомобиля, который может проехать на одном заряде более 1000 км. Уникальность технологии заключается в использовании литий-серного аккумулятора, который имеет более высокую энергетическую плотность, чем традиционные литий-ионные аккумуляторы. Это позволит значительно расширить возможности использования электромобилей и сделать их более доступными и удобными для потребителей.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 11,
            "date": "2023-07-05",
            "title": "Ученые из США создали новый метод редактирования генов для лечения заболеваний",
            "text": "Исследователи из США разработали новый метод редактирования генов, который позволяет точно изменять ДНК и удалить мутации, вызывающие различные заболевания. Новый метод основан на использовании инженерных РНК-молекул, которые способны определить и точно исправить ошибки в геноме организма. Это открывает новые возможности для лечения многих генетических заболеваний и повышения эффективности существующих методов терапии.",
            "author": "admin",
            "comments": [],
            "likes": null
        },
        {
            "id": 12,
            "date": "2023-07-11",
            "title": "В Южной Африке началась крупнейшая за последние десятилетия засуха",
            "text": "Последствия климатических изменений стали ощутимы в Южной Африке, где началась крупнейшая за последние десятилетия засуха. Сельскохозяйственные угодья и пастбища высохли, что привело к резкому сокращению объемов производства продуктов питания, а также потере рабочих мест и ухудшению экономической ситуации в регионе. Власти страны принимают необходимые меры для смягчения последствий засухи и поддержки населения.",
            "author": "admin",
            "comments": [],
            "likes": null
        }
        
    ]
}